Merge pull request #14 from hakanngul/development
Development
